MikroElektronika/core_packages/ARM/gcc_clang/def/silabs/EFM32GG12B410F1024GQ64/mcu.h
typedef struct {
  __IOM uint32_t CTRL; /**< Channel Control Register  */
} PRS_CH_TypeDef;

typedef struct {
  __IOM uint32_t CTRL; /**< Channel Control Register  */
} DMA_CH_TypeDef;

typedef struct {
  __IOM uint32_t CFG;                                /**< Configuration                                      */
  __IOM uint32_t LOOP;                               /**< Loop Counter                                       */
  __IOM uint32_t CTRL;                               /**< Control                                            */
  __IOM uint32_t SRC;                                /**< Source Address                                     */
  __IOM uint32_t DST;                                /**< Destination Address                                */
  __IOM uint32_t LINK;                               /**< Link Address                                       */
  __IOM uint32_t XCTRL;                              /**< Extended Control                                   */
  uint32_t       RESERVED0[1U];                      /**< Reserved for future use                            */
  __IOM uint32_t ILSRC;                              /**< Interleaving Source Address                        */
  uint32_t       RESERVED1[3U];                      /**< Reserved for future use                            */
} LDMA_CH_TypeDef;

/** @} End of group EFM32GG12B410F1024GQ64_Part */

/***************************************************************************//**
 * @defgroup EFM32GG12B410F1024GQ64_Peripheral_TypeDefs Peripheral TypeDefs
 * @{
 * @brief Device Specific Peripheral Register Structures
 ******************************************************************************/

// #include "efm32gg12b_msc.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg12b_emu.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg12b_rmu.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg12b_cmu.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg12b_crypto.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg12b_lesense_st.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg12b_lesense_buf.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg12b_lesense_ch.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg12b_lesense.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg12b_ebi.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg12b_sdio.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg12b_pdm.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg12b_gpio_p.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg12b_gpio.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg12b_prs_ch.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg12b_prs.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg12b_ldma_ch.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg12b_ldma.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg12b_fpueh.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg12b_gpcrc.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg12b_can_mir.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg12b_can.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg12b_timer_cc.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg12b_timer.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg12b_usart.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg12b_qspi.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg12b_leuart.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg12b_letimer.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg12b_cryotimer.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg12b_pcnt.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg12b_i2c.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg12b_adc.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg12b_acmp.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg12b_vdac_opa.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg12b_vdac.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg12b_usb_hc.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg12b_usb_diep.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg12b_usb_doep.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg12b_usb.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg12b_idac.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg12b_csen.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg12b_lcd.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg12b_rtc_comp.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg12b_rtc.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg12b_rtcc_cc.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg12b_rtcc_ret.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg12b_rtcc.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg12b_wdog_pch.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg12b_wdog.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg12b_etm.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg12b_smu.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg12b_trng.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg12b_dma_descriptor.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg12b_devinfo.h"  // Note: Changed for MikroE implementation.
// #include "efm32gg12b_romtable.h"  // Note: Changed for MikroE implementation.

